Repository: darktable-org/darktable
Catalog: doc/usermanual/po/pl.tmx
Source language: en
Languages: pl

source: correct the density of black after the inversion, to adjust the global contrast while avoiding clipping shadows.
pl: skoryguj poziom czerni po inwersji, aby dostosować kontrast globalny, unikając jednocześnie utraty detali w cieniach.

source: paper grade (gamma)
pl: gradacja papieru (gamma)

source: select the grade of the virtual paper, which is actually equivalent to applying a gamma. it compensates the film D max and recovers the contrast. use a high grade for high D max.
pl: wybierz gradację (klasę) papieru, która jest odpowiednikiem współczynnika gamma. Pozwoli ona skompensować maksymalną gęstość (D max) filmu i przywrócić kontrast. użyj wyższej gradacji dla wyższych D max.

source: paper gloss (specular highlights)
pl: połysk papieru

source: gradually compress specular highlights past this value to avoid clipping while pushing the exposure for midtones. this somewhat reproduces the behaviour of matte paper.
pl: stopniowo kompresuje rozświetlenia powyżej zadanej wartości. pozwala to uniknąć prześwietleń podczas podnoszenia ekspozycji tonów średnich. symuluje zachowanie matowego papieru.

source: virtual print emulation
pl: emulacja odbitki

source: print exposure adjustment
pl: korekta ekspozycji odbitki

source: correct the printing exposure after inversion to adjust the global contrast and avoid clipping highlights.
pl: skoryguj ekspozycję odbitki po inwersji, aby dostosować globalny kontrast i uniknąć prześwietleń.

source: denoise (non-local means)
pl: odszumianie (średnie nielokalne)

source: radius of the patches to match
pl: promień łatek do dopasowania

source: how much to smooth brightness
pl: wygładzenie jasności

source: how much to smooth colors
pl: wygładzenie kolorów

source: overexposed
pl: prześwietlenie

source: unbreak input profile
pl: naprawa profilu wejściowego

source: dynamic range
pl: rozpiętość tonalna

source: middle grey luma
pl: luma średniej szarości

source: 16 EV dynamic range (generic)
pl: rozpiętość tonalna 16 EV (generyczna)

source: 14 EV dynamic range (generic)
pl: rozpiętość tonalna 14 EV (generyczna)

source: 12 EV dynamic range (generic)
pl: rozpiętość tonalna 12 EV (generyczna)

source: 10 EV dynamic range (generic)
pl: rozpiętość tonalna 10 EV (generyczna)

source: 08 EV dynamic range (generic)
pl: rozpiętość tonalna 08 EV (generyczna)

source: tone mapping method
pl: metoda mapowania tonów

source: linear part
pl: część liniowa

source: gamma exponential factor
pl: współczynnik wykładniczy gamma

source: adjust to match the average luma of the subject
pl: zmień, aby dopasować średnia lumę obiektu

source: number of stops between middle grey and pure black this is a reading a posemeter would give you on the scene
pl: ilość działek przesłony między średnią szarością, a czystą czernią. jest to wskazanie, które w tej scenie dałby światłomierz

source: number of stops between pure black and pure white this is a reading a posemeter would give you on the scene
pl: ilość działek przesłony między czystą czernią, a czystą bielą. jest to wskazanie, które w tej scenie dałby światłomierz

source: optimize automatically
pl: zoptymalizuj automatycznie

source: enlarge or shrink the computed dynamic range this is useful when noise perturbates the measurements
pl: zwiększ lub zmniejsz wyliczoną rozpiętość tonalną przydatne, gdy szum zaburza pomiar

source: make an optimization with some guessing
pl: dokonaj optymalizacji z odrobiną zgadywania

source: raw denoise
pl: odszumianie (raw)

source: noise threshold
pl: próg szumu

source: raw denoising only works for raw images.
pl: odszumianie RAW działa tylko dla zdjęć raw.

source: raw overexposed
pl: prześwietlenie RAW

source: crop x
pl: x kadru

source: crop from left border
pl: wykadruj od lewej krawędzi

source: crop y
pl: y kadru

source: crop from top
pl: wykadruj z góry

source: crop width
pl: szerokość kadru

source: crop from right border
pl: wykadruj od prawej krawędzi

source: crop height
pl: wysokość kadru

source: crop from bottom
pl: wykadruj od dołu

source: raw black/white point
pl: punkt czerni/bieli RAW

source: passthrough
pl: bez modyfikacji

source: black level %i
pl: poziom czerni %i

source: white point
pl: punkt bieli

source: raw black/white point correction only works for the sensors that need it.
pl: korekta punktu czerni/bieli RAW działa tylko dla sensorów, które tego wymagają.

source: fill-light 0.25EV with 4 zones
pl: wypełnienie światłem 0,25EV w 4 strefach

source: fill-shadow -0.25EV with 4 zones
pl: wypełnienie cieniem -0,25EV w 4 strefach

source: fill light
pl: światło wypełniające

source: width
pl: szerokość

source: the fill-light in EV
pl: światło wypełniające w jednostkach EV

source: width of fill-light area defined in zones
pl: szerokość obszaru wypełnienia światłem określona w strefach

source: select the center of fill-light ctrl+click to select an area
pl: wybór centrum światła wypełniającego kliknij z ctrl, aby zaznaczyć obszar

source: toggle tool for picking median lightness in image
pl: narzędzie do pobierania mediany jasności z obrazu

source: retouch
pl: retusz

source: cannot display scales when the blending mask is displayed
pl: nie można wyświetlić skal, gdy wyświetlana jest maska mieszania

source: # shapes:
pl: # kształtów:

source: to add a shape select an algorithm and a shape type and click on the image. shapes are added to the current scale
pl: aby dodać kształt, wybierz algorytm i typ kształtu i kliknij na zdjęcie. kształty są dodawane do bieżącej skali

source: show and edit shapes on the current scale
pl: pokaż i edytuj kształty w bieżącej skali

source: algorithms:
pl: algorytmy:

source: activates fill tool
pl: włącza narzędzie wypełniania

source: activates blur tool
pl: włącza narzędzie rozmywania

source: activates healing tool
pl: włącza narzędzie łatki

source: activates cloning tool
pl: włącza narzędzie klonowania

source: # scales:
pl: # skal:

source: current:
pl: bieżąca:

source: merge from:
pl: połącz od:

source: top slider adjusts where the merge scales start bottom slider adjusts the number of scales red box indicates the current scale green line indicates that the scale has shapes on it
pl: górny suwak reguluje, gdzie zaczyna się łączenie skal dolny suwak reguluje liczbę skal czerwona ramka wskazuje bieżącą skale zielona linia oznacza, że na tej skali są dodane kształty

source: display masks
pl: wyświetl maski

source: temporarily switch off shapes
pl: tymczasowo wyłącz kształty

source: display wavelet scale
pl: wyświetl skalę falkową

source: cut shapes from current scale
pl: wytnij kształty z biezącej skali

source: paste cut shapes to current scale
pl: wklej wycięte kształty do aktualnej skali

source: preview single scale
pl: podgląd pojedynczej skali

source: adjust preview levels
pl: dopasuj poziomy podglądu

source: auto levels
pl: automatyczne poziomy

source: shape selected:
pl: wybrany kształt:

source: click on a shape to select it, to unselect click on an empty space
pl: kliknij na kształt, żeby go zaznaczyć, żeby odznaczyć, kliknij na wolnym miejscu

source: fill mode
pl: tryb wypełniania

source: erase
pl: usuń

source: erase the detail or fills with chosen color
pl: usuń detal lub wypełnij go wybranym kolorem

source: fill color:
pl: kolor wypełniania:

source: select fill color
pl: wybierz kolor wypełniania

source: pick fill color from image
pl: pobierz kolor wypełniania ze zdjęcia

source: adjusts color brightness to fine-tune it. works with erase as well
pl: zmień jasność koloru w celu precyzyjnego dostrojenia. działa także z „usuń”

source: blur type
pl: rodzaj rozmycia

source: bilateral
pl: bilateralne

source: type for the blur algorithm
pl: rodzaj algorytmu rozmywania

source: blur radius
pl: promień rozmycia

source: radius of the selected blur type
pl: promień wybranego rodzaju rozmycia

source: set the opacity on the selected shape
pl: ustaw krycie wybranego kształtu

source: retouch tools
pl: narzędzia do retuszu

source: wavelet decompose
pl: rozkład falkowy

source: shapes
pl: kształty

source: retouch tool circle
pl: retusz: narzędzie koło

source: retouch tool ellipse
pl: retusz: narzędzie elipsa

source: retouch tool path
pl: retusz: narzędzie ścieżka

source: retouch tool brush
pl: retusz: narzędzie pędzel

source: continuous add circle
pl: ciągłe dodawanie kół

source: continuous add ellipse
pl: ciągłe dodawanie elips

source: continuous add path
pl: ciągłe dodawanie ścieżek

source: continuous add brush
pl: ciągłe dodawanie pędzli

source: show or hide shapes
pl: pokaż lub ukryj krztałty

source: max scale is %i for this image size
pl: maksymalna skala dla tego zdjęcia to %i

source: rgb curve
pl: krzywa rgb

source: contrast compression
pl: kompresja kontrastu

source: gamma 1.0 (linear)
pl: gamma 1.0 (liniowa)

source: contrast - med (linear)
pl: kontrast - średni (liniowy)

source: contrast - high (linear)
pl: kontrast - wysoki (liniowy)

source: contrast - med (gamma 2.2)
pl: kontrast - średni (gamma 2.2)

source: contrast - high (gamma 2.2)
pl: kontrast - wysoki (gamma 2.2)

source: logarithm (base 2)
pl: logarytmiczna (podstawa 2)

source: exponential (base 2)
pl: wykładnicza (podstawa 2)

source: RGB, linked channels
pl: RGB, połączone kanały

source: RGB, independent channels
pl: RGB, niezależne kanały

source: choose between linked and independent channels.
pl: wybierz pomiędzy połączonymi i niezależnymi kanałami

source: curve nodes for r channel
pl: węzły krzywej dla kanału r

source: curve nodes for g channel
pl: węzły krzywej dla kanału g

source: curve nodes for b channel
pl: węzły krzywej dla kanału b

source: compensate middle grey
pl: skompensuj średnią szarość

source: rgb levels
pl: poziomy rgb

source: apply auto levels based on a region defined by the user click and drag to draw the area right click to cancel
pl: zastosuj automatyczną ekspozycję w oparciu o region zdefiniowany przez użytkownika kliknij i przeciągnij, aby zaznaczyć obszar kliknij prawym, aby anulować

source: rotate pixels
pl: obracanie pikseli

source: automatic pixel rotation
pl: automatyczne obracanie pikseli

source: automatic pixel rotation only works for the sensors that need it.
pl: automatyczne obracanie pikseli działa tylko dla sensorów, które tego wymagają.

source: scale pixels
pl: skalowanie pikseli

source: automatic pixel scaling
pl: automatyczne skalowanie pikseli

source: automatic pixel scaling only works for the sensors that need it.
pl: automatyczne skalowanie pikseli działa tylko dla sensorów, które tego wymagają.

source: shadows and highlights
pl: cienie i światła

source: white point adjustment
pl: korekta punktu bieli

source: compress
pl: kompresja

source: shadows color correction
pl: korekcja koloru w cieniach

source: highlights color correction
pl: korekcja koloru w światłach

source: shadows color adjustment
pl: ustawienie koloru w cieniach

source: highlights color adjustment
pl: ustawienie koloru w światłach

source: correct shadows
pl: korekcja cieni

source: correct highlights
pl: korekcja świateł

source: shift white point
pl: przesunięcie punktu bieli

source: filter to use for softening. bilateral avoids halos
pl: filtr używany do zmiękczenia. bilateralny nie daje efektu halo

source: compress the effect on shadows/highlights and preserve midtones
pl: kompresuje efekt na światłach/cieniach oraz zachowuje tony średnie

source: adjust saturation of shadows
pl: regulacja nasycenia dla cieni

source: adjust saturation of highlights
pl: regulacja nasycenia dla świateł

source: spatial extent of the unblurring
pl: zasięg przestrzenny części nierozmytej

source: strength of the sharpen
pl: siła wyostrzenia

source: threshold to activate sharpen
pl: próg aktywacji wyostrzania

source: soften
pl: zmiękczenie

source: the size of blur
pl: rozmiar rozmycia

source: the saturation of blur
pl: nasycenie rozmycia

source: the brightness of blur
pl: jasność rozmycia

source: the mix of effect
pl: miksowanie efektu

source: split-toning
pl: dzielone tonowanie

source: pick primary color
pl: wybierz pierwszorzędny kolor

source: pick secondary color
pl: wybierz drugorzędny kolor

source: shadows-hue
pl: cienie: odcień

source: shadows-saturation
pl: cienie: nasycenie

source: highlights-hue
pl: światła: odcień

source: highlights-saturation
pl: światła: nasycenie

source: balance
pl: balans

source: authentic sepia
pl: prawdziwa sepia

source: authentic cyanotype
pl: prawdziwa cyjanotypia

source: authentic platinotype
pl: prawdziwa platynotypia

source: chocolate brown
pl: brąz czekoladowy

source: select tone color
pl: wybór koloru tonu

source: select the saturation tone
pl: nasycenie tonu

source: properties
pl: właściwości

source: the balance of center of split-toning
pl: balans środka dzielonego tonowania

source: compress the effect on highlights/shadows and preserve midtones
pl: kompresuje efekt na światłach/cieniach oraz zachowuje tony pośrednie

source: spot removal
pl: usuwanie plam

source: spot module is limited to 64 shapes. please add a new instance !
pl: moduł usuwania plam ma ograniczenie do 64 krzywych. dodaj nową instancję.

source: number of strokes:
pl: liczba kresek:

source: click on a shape and drag on canvas. use the mouse wheel to adjust size. right click to remove a shape.
pl: kliknij na kształt i przeciągnij, aby skorygować. użyj kółka myszy, aby zmienić rozmiar. kliknij prawym przyciskiem, aby usunąć.

source: show and edit shapes
pl: pokaż i edytuj kształty

source: spot circle tool
pl: plamy: narzędzie koło

source: spot ellipse tool
pl: plamy: narzędzie elipsa

source: spot path tool
pl: plamy: narzędzie ścieżka

source: white balance
pl: balans bieli

source: tint
pl: odcień

source: temperature
pl: temperatura

source: preset/camera
pl: ustawienie/aparat

source: preset/camera neutral
pl: ustawienie/aparat (neutralne)

source: preset/spot
pl: ustawienie/punktowy

source: camera neutral
pl: aparat (neutralne)

source: spot
pl: punktowy

source: user modified
pl: ustawiony przez użytkownika

source: `%s' color matrix not found for image
pl: nie znaleziono macierzy koloru „%s” dla zdjęcia

source: failed to read camera white balance information from `%s'!
pl: nie udało się wczytać informacji o balansie bieli aparatu z „%s”!

source: cyan
pl: cyjan

source: emerald
pl: szmaragdowy

source: choose white balance preset from camera
pl: wybór ustawień balansu bieli z aparatu

source: finetune
pl: dostrajanie

source: fine tune white balance preset
pl: dostrojenie ustawienia balansu bieli

source: white balance disabled for camera
pl: balans bieli niedostępny dla tego aparatu

source: tone curve
pl: krzywa tonalna

source: base of the logarithm
pl: podstawa logarytmu

source: color space
pl: przestrzeń kolorów

source: Lab, linked channels
pl: Lab, połączone kanały

source: Lab, independent channels
pl: Lab, niezależne kanały

source: XYZ, linked channels
pl: XYZ, połączone kanały

source: if set to auto, a and b curves have no effect and are not displayed. chroma values (a and b) of each pixel are then adjusted based on L curve data. auto XYZ is similar but applies the saturation changes in XYZ space.
pl: jeśli ustawione jest auto, krzywe a i b nie działają oraz nie są wyświetlane. wartości chrominancji (a i b) każdego piksela są dostosowywane na podstawie krzywej L. auto XYZ działa podobnie, ale wprowadza zmiany saturacji w przestrzeni XYZ.

source: tonecurve for L channel
pl: krzywa tonalna kanału L

source: tonecurve for a channel
pl: krzywa tonalna kanału a

source: tonecurve for b channel
pl: krzywa tonalna kanału b

source: log
pl: logarytmiczna

source: tone equalizer
pl: korektor tonów

source: blacks
pl: czernie

source: deep shadows
pl: głębokie cienie

source: light shadows
pl: jasne cienie

source: midtones
pl: tony średnie

source: dark highlights
pl: ciemne światła

source: whites
pl: biele

source: speculars
pl: błyski

source: filter diffusion
pl: dyfuzja filtra

source: smoothing diameter
pl: średnica wygładzania

source: edges refinement or feathering
pl: wtapianie/dopasowywanie krawędzi

source: mask quantization
pl: kwantyzacja maski

source: mask exposure compensation
pl: kompensacja ekspozycji maski

source: mask contrast compensation
pl: kompensacja kontrastu maski

source: luminance estimator
pl: estymator luminancji

source: preserve details
pl: ochrona detali

source: mask blending : none
pl: mieszanie maski: brak

source: mask blending : landscapes
pl: mieszanie maski: krajobraz

source: mask blending : all purposes
pl: mieszanie maski: ogólne przeznaczenie

source: mask blending : isolated subjects
pl: mieszanie maski: izolowane obiekty

source: compress shadows/highlights : soft
pl: kompresja cieni/świateł: lekka

source: compress shadows/highlights : strong
pl: kompresja cieni/świateł: mocna

source: relight : fill-in
pl: doświetlanie

source: tone equalizer needs to be after distorsion modules in the pipeline – disabled
pl: korektor tonów musi być ulokowany w potoku przetwarzania za modułami zniekształceń - wyłączony

source: tone equalizer failed to allocate memory, check your RAM settings
pl: korektor tonów nie mógł zaalokować pamięci, sprawdź ustawienia RAM

source: tone equalizer in/out buffer are ill-aligned, please report the bug to the developers
pl: bufory we/wy korektora tonów są nieprawidłowo wyrównane, zaraportuj ten błąd deweloperom

source: the interpolation is unstable, decrease the curve smoothing
pl: interpolacja jest niestabilna, zmniejsz stopień wygładzania krzywej

source: wait for the preview to finish recomputing
pl: poczekaj na odświeżanie podglądu

source: some parameters are out-of-bounds
pl: niektóre parametry są poza zakresem

source: simple
pl: podstawowe

source: advanced
pl: zaawansowane

source: masking
pl: maska

source: double-click to reset the curve
pl: kliknij dwukrotnie, aby zresetować krzywą

source: curve smoothing
pl: wygładzanie krzywej

source: positive values will produce more progressive tone transitions but the curve might become oscillatory in some settings. negative values will avoid oscillations and behave more robustly but may produce brutal tone transitions and damage local contrast.
pl: wartości dodatnie dadzą gładsze przejścia tonalne, ale w niektórych przypadkach mogą pojawić się oscylacje krzywej. wartości ujemne pomogą uniknąć oscylacji ale mogą spowodować mniej gładkie przejścia tonalne, i utratę lokalnego kontrastu.

source: RGB average
pl: średnia RGB

source: HSL lightness
pl: jasność HSL

source: HSV value / RGB max
pl: wartość HSV / maks. RGB

source: RGB sum
pl: suma RGB

source: RGB euclidean norm
pl: euklidesowo znormalizowane RGB

source: RGB geometric mean
pl: uśrednione geometrycznie RGB

source: preview the mask and chose the estimator that gives you the higher contrast between areas to dodge and areas to burn
pl: podejrzyj maskę i wybierz estymator, który daje ci większy kontrast między obszarami do rozjaśnienia i przyciemnienia

source: averaged guided filter
pl: uśredniony filtr prowadzony

source: guided filter
pl: filtr prowadzony

source: 'no' affects global and local contrast (safe if you only add contrast) 'guided filter' only affects global contrast and tries to preserve local contrast 'averaged guided filter' is a geometric mean of both methods
pl: 'no' wpływa na globalny i lokalny kontrast (bezpieczne, jeśli chcesz tylko dodać kontrastu) 'guided filter' wpływa tylko na kotrast globalny i stara się zachować kontrast lokalny 'averaged guided filter' jest średnią geometryczną obu metod

source: number of passes of guided filter to apply helps diffusing the edges of the filter at the expense of speed
pl: ilość przejść filtra prowadzonego pomaga rozproszyć krawędzie filtra kosztem prędkości działania

source: diameter of the blur in percent of the largest image size warning: big values of this parameter can make the darkroom preview much slower if denoise profiled is used.
pl: średnica rozmycia w procentach większego wymiaru obrazu uwaga: duże wartości tego parametru mogą spowodować, że podgląd w trybie ciemni będzie znacznie wolniejszy, jeśli w użyciu jest odszumianie profilowane.

source: edges refinement/feathering
pl: wtapianie/dopasowywanie krawędzi

source: precision of the feathering : higher values force the mask to follow edges more closely but may void the effect of the smoothing lower values give smoother gradients and better smoothing but may lead to inaccurate edges taping and halos
pl: precyzja wtapiania: wyższe wartości powodują, że maska przylega bliżej do krawędzi, ale może to zniwelować efekt wygładzania. niższe wartości dają gładszy gradient i lepsze wygładzanie, ale może to prowadzić do niedokładności w podążaniu za krawędziami

source: mask post-processing
pl: przetwarzanie maski

source: mask histogram span between the first and last deciles. the central line shows the average. orange bars appear at extrema if clipping occurs.
pl: rozkład histogramu maski pomiędzy pierwszym i ostatnim decylem. środkowa linia wskazuje średnią. pomarańczowe linie na krańcach oznaczają przekroczenie zakresu.

source: 0 disables the quantization. higher values posterize the luminance mask to help the guiding produce piece-wise smooth areas when using high feathering values
pl: 0 wyłącza kwantyzację. wyższe wartości powodują posteryzację maski luminancji co daje gładkie obszary na poziomie elementów, gdy używane są wyższe wartości wtapiania

source: use this to slide the mask average exposure along channels for a better control of the exposure correction with the available nodes. the picker will auto-adjust the average exposure at -4EV.
pl: użyj, aby przesunąć średnią ekspozycję maski wzdłuż kanałów dla lepszej kontroli nad korekcją ekspozycji. zakraplacz automatycznie ustawi średnią na poziomie -4EV.

source: use this to counter the averaging effect of the guided filter and dilate the mask contrast around -4EV this allows to spread the exposure histogram over more channels for a better control of the exposure correction.
pl: użyj, aby przeciwdziałać efektowi uśredniania i rozszerzyć kontrast maski w okolicach -4EV pozwala to rozciągnąć histogram ekspozycji na większą liczbę kanałów dla lepszej kontroli nad korekcją ekspozycji.

source: display exposure mask
pl: wyświetl maskę ekspozycji

source: tone mapping
pl: mapowanie tonów

source: mid-tones bias
pl: przewaga tonów średnich

source: the strength of saturation boost
pl: siła wzmocnienia nasycenia

source: how much to spare highlights and shadows
pl: ilość pozostawionych świateł i cieni

source: the amount of vibrance
pl: ilość ożywienia

source: vignetting
pl: winietowanie

source: fall-off strength
pl: siła zanikania

source: horizontal center
pl: środek w poziomie

source: vertical center
pl: środek w pionie

source: shape
pl: kształt

source: width-height ratio
pl: proporcje szerokość-wysokość

source: lomo
pl: łomo

source: automatic ratio
pl: proporcje automatyczne

source: 8-bit output
pl: wyjście 8-bitowe

source: 16-bit output
pl: wyjście 16-bitowe

source: width/height ratio
pl: proporcje szerokość/wysokość

source: the radii scale of vignette for start of fall-off
pl: rozmiar promienia winietowania do początku zanikania

source: the radii scale of vignette for end of fall-off
pl: rozmiar promienia winietowania do końca zanikania

source: strength of effect on brightness
pl: siła efektu dla jasności

source: strength of effect on saturation
pl: siła efektu dla nasycenia

source: horizontal offset of center of the effect
pl: poziome przesunięcie środka efektu

source: vertical offset of center of the effect
pl: pionowe przesunięcie środka efektu

source: shape factor 0 produces a rectangle 1 produces a circle or ellipse 2 produces a diamond
pl: parametr kształtu 0 tworzy prostokąt 1 tworzy koło lub elipsę 2 tworzy romb
